---
kind: property
id: P:Autodesk.Revit.DB.WorksharingSaveAsOptions.ClearTransmitted
source: html/0289f8a9-1156-868f-6fcc-5ccf7c38fb23.htm
---
# Autodesk.Revit.DB.WorksharingSaveAsOptions.ClearTransmitted Property

For a transmitted model opened with DetachAndPreserveWorksets,
 clear its transmitted flag in the Save/SaveAs operation.

## Syntax (C#)
```csharp
public bool ClearTransmitted { get; set; }
```